In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
csv_file = "../ETL_Project/average_wages.csv"
avg_wages_df = pd.read_table(csv_file,sep=',')
avg_wages_df.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME  Value  Flag Codes
0      AUS    AVWAGE     TOT     USD         A  1990  39073         NaN
1      AUS    AVWAGE     TOT     USD         A  1991  38864         NaN
2      AUS    AVWAGE     TOT     USD         A  1992  39626         NaN
3      AUS    AVWAGE     TOT     USD         A  1993  40003         NaN
4      AUS    AVWAGE     TOT     USD         A  1994  40295         NaN

In [3]:
avg_wages_drop = avg_wages_df[['LOCATION','MEASURE','TIME','Value']]
avg_wages_drop.head()

  LOCATION MEASURE  TIME  Value
0      AUS     USD  1990  39073
1      AUS     USD  1991  38864
2      AUS     USD  1992  39626
3      AUS     USD  1993  40003
4      AUS     USD  1994  40295

In [4]:
avg_wages_drop.dtypes

LOCATION    object
MEASURE     object
TIME         int64
Value        int64
dtype: object

In [5]:
avg_wages_drop['TIME'].unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016])

In [7]:
avg_wages_2016 = avg_wages_df[avg_wages_df['TIME']==2016]
avg_wages_2016.head()

    LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME  Value  Flag Codes
26       AUS    AVWAGE     TOT     USD         A  2016  52063         NaN
53       AUT    AVWAGE     TOT     USD         A  2016  48295         NaN
80       BEL    AVWAGE     TOT     USD         A  2016  49587         NaN
107      CAN    AVWAGE     TOT     USD         A  2016  48403         NaN
129      CZE    AVWAGE     TOT     USD         A  2016  23722         NaN